# GetTextureSet

## Description
Gets the texture set of an object.

```pascal
FUNCTION GetTextureSet(obj : HANDLE): INTEGER;
```

```python
def vs.GetTextureSet(obj):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object.|

## See Also
VS Functions:
SetTextureSet

## Version
Availability: from Vectorworks 2011

## Category
* Textures